tutorials/basic/simpleFoam/implicitAMI/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
    }

    AMI2
    {
        type            cyclicAMI;
    }

    top
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    bottom
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    left
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    right
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
